ex1:proc options(main);
     dcl A bin fixed (31) init (3);
     dcl B bin fixed (31) init (4);
     dcl C bin fixed (31) init (5);
     dcl D bin fixed (31);
     D=A+B-C;
end ex1;

